package dina.library;

public interface LibratyID {

    int LIBRARY_COUNT = 9;
    //
    int SYSTEM = 0;//системные функции
    int GRAPHICS = 1;//функции для работы с графикой
    int MATH = 2;//математические функции
    int CONSOLE = 3;//базовые функции ввода-вивода
    int STRING = 4;//функции для работы со строками
    int IO = 5;//функции для работа с потоками инфомации и файловой системой
    int EVENTS = 6;//функции обработки событий
    int UI = 7;//функции для работы с пользовательским интерфейсом
    int DATE = 8;//функции для работы с датой
}
